[
    {
        "name": "android",
        "link": "",
        "class": "android",
        "button": "android-button",
        "wire-button": "android-wire",
        "screen-button": "android-screen",
        "range-slide": "android-range",
        "what": "<p>This layout is the centerpiece of Android’s home page.</p>",
        "why": "<p>I was excited to make this because there were a few interesting features that piqued my curiosity.</p><p>In the top section, there is a large image overlaid by a grid. I was interested in how that worked.I also wanted to know how they made the screen slider and how the images and background colors seamlessly switched out when the radio buttons were clicked.</p><p>Finally, in Android’s version, the middle grid is lopsided. I thought there might have been a reason. </p><p>There isn’t. It was a design choice and it drove me crazy.</p>",
        "whyText": "why though",
        "diffText": "",
        "howText": "",
        "layout": "android",
        "id": "android-id"
    },
    {
        "name": "video-cta",
        "link": "",
        "class": "video-cta",
        "button": "video",
        "wire-button": "video-wire",
        "screen-button": "video-screen",
        "range-slide": "video-range",
        "what": "<p>This layout was inspired by a Tiffany CTA layout they had on their site for Christmas.</p>",
        "why": "<p>I chose to emulate this layout because I was interested in working with videos. They also had an interesting play/pause functionality that I was curious about.</p> <p>As it turns out, it’s incredibly easy to make this happen with Vanilla JS due to there being play/pause functions already existing.</p> ",
        "whyText": "why though",
        "diffText": "",
        "howText": "",
        "layout": "video-cta",
        "id": "video-cta"
    },
    {
        "name": "Shell",
        "link": "",
        "class": "shell",
        "button": "shell-button",
        "wire-button": "shell-wire",
        "screen-button": "shell-screen",
        "range-slide": "shell-range",
        "what": "<p>This was a large grid layout on Shell’s home page.</p>",
        "why": "<p>Disclaimer: I am in no way a fan or friend of Shell oil.</p><p>That being said, the grid was intriguing. It changed drastically over screen sizes and even individual cells. The cards themselves were designed well and as an added bonus, they also had these smooth hover choices.</p>",
        "whyText": "why though",
        "diffText": "",
        "howText": "",
        "layout": "shell",
        "id": "shell"
    },
    {
        "name": "timberland",
        "link": "https://web.archive.org/web/20230824060314/https://www.timberland.com/en-us",
        "class": "timberland",
        "button": "timland",
        "wire-button": "timland-wire",
        "screen-button": "timland-screen",
        "range-slide": "timland-range",
        "what": "<p>This is an ad template used on the ever-changing Timberland website. It doesn’t exist anymore, but if you visit the site you’ll see many more like it.</p> ",
        "why": "<p>Timberland’s website is what got me thinking about layouts in the first place. Their designs are this mix of sanitized corporation and hip-hop grunge that speaks to me… which makes sense because my sister works there as a designer.</p><p>I wanted to make this one because it displayed an interesting use of grid and absolute positioning.</p>",
        "whyText": "why though",
        "diffText": "",
        "howText": "",
        "layout": "timberland",
        "id": "timland"
    },
    {
        "name": "Game Spot",
        "link": "https://www.gamespot.com/",
        "class": "game-spot",
        "button": "game-spot-button",
        "wire-button": "game-wire",
        "screen-button": "game-screen",
        "range-slide": "game-range",
        "what": "<p>This layout comes from GameSpot, a video game news and reviews site. It’s the main layout on their home page for pushing their newest articles.</p>",
        "why": "<p>This was the first large-scale grid I created and I needed the practice. Up until I made this, I was still using grid-template-areas. Another interesting aspect of this layout was the hover effect on the top two cells; something I was very interested in recreating.</p>",
        "whyText": "why though",
        "diffText": "",
        "howText": "",
        "layout": "game-spot",
        "id": "game-spot"
    },
    {
        "name": "Timberland Product List",
        "link": "",
        "class": "product",
        "button": "product-list",
        "wire-button": "product-wire",
        "screen-button": "product-screen",
        "range-slide": "product-range",
        "what": "<p>Another layout from Timberland. This is an attempt to make a product list like you might see on any clothing brand's site.</p>",
        "why": "<p>Disclaimer: This is yet to be finished. But I’m working on that as you read.</p><p>As mentioned before, I love Timberland’s site. This was a chance to understand how products were laid out in an online store. I was also interested in how they were able to switch out the images on hover. I also wanted to understand how the Js was working behind the scenes to change the images when the buttons were clicked (in my case the black circles).</p>",
        "whyText": "why though",
        "diffText": "",
        "howText": "",
        "layout": "product-list",
        "id": "product"
    },
    {
        "name": "vacation cards",
        "link": "",
        "class": "cards",
        "button": "vacation",
        "wire-button": "vacation-wire",
        "range-slide": "cards-range",
        "what": "<p>This was inspired by my love of travel and my constant need to be in a beach resort. I had been researching luxury beach resorts for a website I was working on and decided to design and code some experience package cards.</p>",
        "why": "<p>This gave me a chance to experiment with taking an idea from research to design to code. It also gave me a lot of practice with making cards and ensuring that the length of text didn’t cause an offset in the uniformity of the overall grid.</p>",
        "screen-button": "vacation-screen",
        "whyText": [
            "<p>Initially, these vacation cards were part of a resort website I was working on. We needed cards for experience packages. I had seen something similar to this when I was performing design research for the project.", "This was my take on the idea, but unfortunately, the rounded corners didn’t match the overall website, so it had to be scrapped.<p>"

        ],
        "diffText": [
            "<p>Making the initial card wasn’t a problem but finding a way to stretch the images across them was. Even when I figured out a way to do this, I was still left with the unfortunate truth that half the image would be obscured by the text box.</p>",
            "<p>I dealt with this by dropping the opacity, but as you can see with the diver card, it failed to solve the issue.</p>",
            "<p>Another unexpected problem occurred when I realized that adding more text would send the textbox past the card’s boundaries, causing the grid of cards to become unaligned.</p>",
            "<p>I could have used ellipsis to solve this but that comes with its own issues.</p>", 
            "<p>In the end, I left it up to the marketing people to write concise content.<p>"
        ],
        "howText": [
            "<p>The cards themselves are being generated by a PHP loop that's pulling from a JSON file. They're being aligned and organized with CSS grid. The background images are being positioned using absolute positioning and object-fit. Like this:</p>"

        ],
        "codeExample": [
            "code-pen.html"
        ],
        "layout": "layout-cards",
        "id": "cards"
    },
    {
        "name": "cool girls",
        "link": "",
        "class": "cool-girls",
        "button": "girls",
        "wire-button": "cool-girls-wire",
        "screen-button": "cool-girls-screen",
        "range-slide": "cool-girls-range",
        "what": "<p>Inspired by my time looking at online clothing realtors, I wanted to make my own custom layout. I wanted it to have the same hip-hop streetwear vibe as the Timberland website.</p>",
        "why": "<p>This gave me another chance to explore the design process from start to finish while practicing coding layouts. Personally, my favorite aspects of this grid are the hover effects and the appearance of the links.</p>",
        "whyText": "why though",
        "diffText": "",
        "howText": "",
        "layout": "custom-grid",
        "id": "cool-girls"
    }
]


